Falconcodes/Old-main-Kurskaya/FreeRTOS/Projects/TeslaMainBoard/drivers-board/stm32f0_tesla_board.c
/* Includes ------------------------------------------------------------------*/
#include "stm32f0_tesla_board.h"
#include "stm32f0_discovery.h"
#include "CommonConfig.h"



/* STM32F0_TESLA_BOARD_LOW_LEVEL_Private_Variables */
const uint16_t RELAY_PIN[RELAYn] =      { RELAY1_PIN,
                                          RELAY2_PIN,
                                          RELAY3_PIN,
                                          RELAY4_PIN,
                                          RELAY5_PIN,
                                          RELAY6_PIN,
                                          RELAY7_PIN,
                                          RELAY8_PIN,
                                          RELAY9_PIN,
                                          RELAY10_PIN,
                                          RELAY11_PIN,
                                          RELAY12_PIN,
                                          RELAY13_PIN,
                                          RELAY14_PIN,
                                          RELAY15_PIN,
                                          RELAY16_PIN,
                                          RELAY17_PIN };

GPIO_TypeDef* RELAY_GPIO_PORT[RELAYn] = { RELAY1_GPIO_PORT,
                                          RELAY2_GPIO_PORT,
                                          RELAY3_GPIO_PORT,
                                          RELAY4_GPIO_PORT,
                                          RELAY5_GPIO_PORT,
                                          RELAY6_GPIO_PORT,
                                          RELAY7_GPIO_PORT,
                                          RELAY8_GPIO_PORT,
                                          RELAY9_GPIO_PORT,
                                          RELAY10_GPIO_PORT,
                                          RELAY11_GPIO_PORT,
                                          RELAY12_GPIO_PORT,
                                          RELAY13_GPIO_PORT,
                                          RELAY14_GPIO_PORT,
                                          RELAY15_GPIO_PORT,
                                          RELAY16_GPIO_PORT,
                                          RELAY17_GPIO_PORT };

const uint32_t RELAY_GPIO_CLK[RELAYn] = { RELAY1_GPIO_CLK,
                                          RELAY2_GPIO_CLK,
                                          RELAY3_GPIO_CLK,
                                          RELAY4_GPIO_CLK,
                                          RELAY5_GPIO_CLK,
                                          RELAY6_GPIO_CLK,
                                          RELAY7_GPIO_CLK,
                                          RELAY8_GPIO_CLK,
                                          RELAY9_GPIO_CLK,
                                          RELAY10_GPIO_CLK,
                                          RELAY11_GPIO_CLK,
                                          RELAY12_GPIO_CLK,
                                          RELAY13_GPIO_CLK,
                                          RELAY14_GPIO_CLK,
                                          RELAY15_GPIO_CLK,
                                          RELAY16_GPIO_CLK,
                                          RELAY17_GPIO_CLK };

const uint16_t LED_PIN[BOARD_LEDn] =      { BOARD_LED1_PIN,
                                            BOARD_LED2_PIN,
                                            BOARD_LED3_PIN };

GPIO_TypeDef* LED_GPIO_PORT[BOARD_LEDn] = { BOARD_LED1_GPIO_PORT,
                                            BOARD_LED2_GPIO_PORT,
                                            BOARD_LED3_GPIO_PORT };

const uint32_t LED_GPIO_CLK[BOARD_LEDn] = { BOARD_LED1_GPIO_CLK,
                                            BOARD_LED2_GPIO_CLK,
                                            BOARD_LED3_GPIO_CLK };

const uint16_t INPUT_PIN[INPUTn] =      { INPUT1_PIN,
                                          INPUT2_PIN,
                                          INPUT3_PIN,
                                          INPUT4_PIN,
                                          INPUT5_PIN,
                                          INPUT6_PIN,
                                          INPUT7_PIN,
                                          INPUT8_PIN };

GPIO_TypeDef* INPUT_GPIO_PORT[INPUTn] = { INPUT1_GPIO_PORT,
                                          INPUT2_GPIO_PORT,
                                          INPUT3_GPIO_PORT,
                                          INPUT4_GPIO_PORT,
                                          INPUT5_GPIO_PORT,
                                          INPUT6_GPIO_PORT,
                                          INPUT7_GPIO_PORT,
                                          INPUT8_GPIO_PORT };

const uint32_t INPUT_GPIO_CLK[INPUTn] = { INPUT1_GPIO_CLK,
                                          INPUT2_GPIO_CLK,
                                          INPUT3_GPIO_CLK,
                                          INPUT4_GPIO_CLK,
                                          INPUT5_GPIO_CLK,
                                          INPUT6_GPIO_CLK,
                                          INPUT7_GPIO_CLK,
                                          INPUT8_GPIO_CLK };

const uint32_t INPUT_EXTI_LINE[INPUTn] = {INPUT1_EXTI_LINE,
                                          INPUT2_EXTI_LINE,
                                          INPUT3_EXTI_LINE,
                                          INPUT4_EXTI_LINE,
                                          INPUT5_EXTI_LINE,
                                          INPUT6_EXTI_LINE,
                                          INPUT7_EXTI_LINE,
                                          INPUT8_EXTI_LINE };

const uint32_t INPUT_EXTI_PORT_SOURCE[INPUTn] = {INPUT1_EXTI_PORT_SOURCE,
                                                 INPUT2_EXTI_PORT_SOURCE,
                                                 INPUT3_EXTI_PORT_SOURCE,
                                                 INPUT4_EXTI_PORT_SOURCE,
                                                 INPUT5_EXTI_PORT_SOURCE,
                                                 INPUT6_EXTI_PORT_SOURCE,
                                                 INPUT7_EXTI_PORT_SOURCE,
                                                 INPUT8_EXTI_PORT_SOURCE };

const uint32_t INPUT_EXTI_PIN_SOURCE[INPUTn] = {INPUT1_EXTI_PIN_SOURCE,
                                                INPUT2_EXTI_PIN_SOURCE,
                                                INPUT3_EXTI_PIN_SOURCE,
                                                INPUT4_EXTI_PIN_SOURCE,
                                                INPUT5_EXTI_PIN_SOURCE,
                                                INPUT6_EXTI_PIN_SOURCE,
                                                INPUT7_EXTI_PIN_SOURCE,
                                                INPUT8_EXTI_PIN_SOURCE };

const uint32_t INPUT_EXTI_IRQn[INPUTn] = {INPUT1_EXTI_IRQn,
                                          INPUT2_EXTI_IRQn,
                                          INPUT3_EXTI_IRQn,
                                          INPUT4_EXTI_IRQn,
                                          INPUT5_EXTI_IRQn,
                                          INPUT6_EXTI_IRQn,
                                          INPUT7_EXTI_IRQn,
                                          INPUT8_EXTI_IRQn };

