Falconcodes/Old-main-Kurskaya/FreeRTOS/Projects/TeslaMainBoard/drivers-board/stm32f0_tesla_board.c
const uint16_t ANALOG_IN_PIN[ANALOG_INn] =         { ANALOG_IN1_PIN,
                                                     ANALOG_IN2_PIN,
                                                     ANALOG_IN3_PIN,
                                                     ANALOG_IN4_PIN,
                                                     ANALOG_IN5_PIN,
                                                     ANALOG_IN6_PIN };

GPIO_TypeDef* ANALOG_IN_GPIO_PORT[ANALOG_INn] =    { ANALOG_IN1_GPIO_PORT,
                                                     ANALOG_IN2_GPIO_PORT,
                                                     ANALOG_IN3_GPIO_PORT,
                                                     ANALOG_IN4_GPIO_PORT,
                                                     ANALOG_IN5_GPIO_PORT,
                                                     ANALOG_IN6_GPIO_PORT };

const uint32_t ANALOG_IN_GPIO_CLK[ANALOG_INn] =    { ANALOG_IN1_GPIO_CLK,
                                                     ANALOG_IN2_GPIO_CLK,
                                                     ANALOG_IN3_GPIO_CLK,
                                                     ANALOG_IN4_GPIO_CLK,
                                                     ANALOG_IN5_GPIO_CLK,
                                                     ANALOG_IN6_GPIO_CLK };

const uint32_t ANALOG_IN_ADC_CHANNEL[ANALOG_INn] = { ANALOG_IN1_ADC_CHANNEL,
                                                     ANALOG_IN2_ADC_CHANNEL,
                                                     ANALOG_IN3_ADC_CHANNEL,
                                                     ANALOG_IN4_ADC_CHANNEL,
                                                     ANALOG_IN5_ADC_CHANNEL,
                                                     ANALOG_IN6_ADC_CHANNEL };

__IO uint16_t ANALOG_IN_BUFFER[ANALOG_INn];


const uint16_t PWM_OUT_PIN[PWM_OUTn] =      { PWM_OUT1_PIN };

GPIO_TypeDef* PWM_OUT_GPIO_PORT[PWM_OUTn] = { PWM_OUT1_GPIO_PORT };

const uint32_t PWM_OUT_GPIO_CLK[PWM_OUTn] = { PWM_OUT1_GPIO_CLK };

const uint16_t PWM_OUT_SOURCE[PWM_OUTn] =   { PWM_OUT1_SOURCE };

const uint16_t PWM_OUT_AF[PWM_OUTn] =       { PWM_OUT1_AF };

TIM_TypeDef* PWM_OUT_TIM[PWM_OUTn] =        { PWM_OUT1_TIM };

const uint32_t PWM_OUT_TIM_CLK[PWM_OUTn] =  { PWM_OUT1_TIM_RCC };

TIM_OCInitTypeDef PWM_OCInitStructure[PWM_OUTn];
uint16_t PWMTimerPeriod[PWM_OUTn] = { 0 };
uint16_t PWMPulse[PWM_OUTn] =       { 0 };


TIM_TypeDef* ENCODER_TIM[ENCODERn] =            { ENCODER1_TIM,
                                                  ENCODER2_TIM,
                                                  ENCODER3_TIM };

typedef void (*ClockFuncType)(uint32_t, FunctionalState);
ClockFuncType ENCODER_TIM_CLOCK_CMD[ENCODERn] = { ENCODER1_TIM_CLOCK_CMD,
                                                  ENCODER2_TIM_CLOCK_CMD,
                                                  ENCODER3_TIM_CLOCK_CMD };

const uint32_t ENCODER_TIM_CLK[ENCODERn] =      { ENCODER1_TIM_RCC,
                                                  ENCODER2_TIM_RCC,
                                                  ENCODER3_TIM_RCC };

const uint16_t ENCODER_CH1_PIN[ENCODERn] =      { ENCODER1_CH1_PIN,
                                                  ENCODER2_CH1_PIN,
                                                  ENCODER3_CH1_PIN };

GPIO_TypeDef* ENCODER_CH1_GPIO_PORT[ENCODERn] = { ENCODER1_CH1_GPIO_PORT,
                                                  ENCODER2_CH1_GPIO_PORT,
                                                  ENCODER3_CH1_GPIO_PORT };

const uint32_t ENCODER_CH1_GPIO_CLK[ENCODERn] = { ENCODER1_CH1_GPIO_CLK,
                                                  ENCODER2_CH1_GPIO_CLK,
                                                  ENCODER3_CH1_GPIO_CLK };

const uint16_t ENCODER_CH1_SOURCE[ENCODERn] =   { ENCODER1_CH1_SOURCE,
                                                  ENCODER2_CH1_SOURCE,
                                                  ENCODER3_CH1_SOURCE };

const uint16_t ENCODER_CH1_AF[ENCODERn] =       { ENCODER1_CH1_AF,
                                                  ENCODER2_CH1_AF,
                                                  ENCODER3_CH1_AF };

const uint16_t ENCODER_CH2_PIN[ENCODERn] =      { ENCODER1_CH2_PIN,
                                                  ENCODER2_CH2_PIN,
                                                  ENCODER3_CH2_PIN };

GPIO_TypeDef* ENCODER_CH2_GPIO_PORT[ENCODERn] = { ENCODER1_CH2_GPIO_PORT,
                                                  ENCODER2_CH2_GPIO_PORT,
                                                  ENCODER3_CH2_GPIO_PORT };

const uint32_t ENCODER_CH2_GPIO_CLK[ENCODERn] = { ENCODER1_CH2_GPIO_CLK,
                                                  ENCODER2_CH2_GPIO_CLK,
                                                  ENCODER3_CH2_GPIO_CLK };

const uint16_t ENCODER_CH2_SOURCE[ENCODERn] =   { ENCODER1_CH2_SOURCE,
                                                  ENCODER2_CH2_SOURCE,
                                                  ENCODER3_CH2_SOURCE };

const uint16_t ENCODER_CH2_AF[ENCODERn] =       { ENCODER1_CH2_AF,
                                                  ENCODER2_CH2_AF,
                                                  ENCODER3_CH2_AF };

/* -------------------------------------------------------------------------- */

/* STM32F0_TESLA_BOARD_LOW_LEVEL_Private_Functions */

/**
  * @brief  Configures RELAY GPIO.
  * @param  Relay: Specifies the Relay to be configured.
  *   This parameter can be one of following parameters:
  *     @arg RELAY_IAKOV_1
  *     @arg RELAY_IAKOV_2
  *     @arg RELAY_MARKS_GEN
  *     @arg RELAY_FINAL
  * @retval None
  */
void STM_TESLA_RELAYInit(Relay_TypeDef Relay)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the RELAY_GPIO Clock */
  RCC_AHBPeriphClockCmd(RELAY_GPIO_CLK[Relay], ENABLE);

  /* Configure the RELAY_GPIO pin */
  GPIO_InitStructure.GPIO_Pin = RELAY_PIN[Relay];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(RELAY_GPIO_PORT[Relay], &GPIO_InitStructure);
}

/**
  * @brief  Turns selected Relay On.
  * @param  Relay: Specifies the Relay to be set on.
  *   This parameter can be one of following parameters:
  *     @arg RELAY_IAKOV_1
  *     @arg RELAY_IAKOV_2
  *     @arg RELAY_MARKS_GEN
  *     @arg RELAY_FINAL
  * @retval None
  */
void STM_TESLA_RELAYOn(Relay_TypeDef Relay)
{
  RELAY_GPIO_PORT[Relay]->BSRR = RELAY_PIN[Relay];
}

/**
  * @brief  Turns selected Relay Off.
  * @param  Relay: Specifies the Relay to be set off.
  *   This parameter can be one of following parameters:
  *     @arg RELAY_IAKOV_1
  *     @arg RELAY_IAKOV_2
  *     @arg RELAY_MARKS_GEN
  *     @arg RELAY_FINAL
  * @retval None
  */
void STM_TESLA_RELAYOff(Relay_TypeDef Relay)
{
  RELAY_GPIO_PORT[Relay]->BRR = RELAY_PIN[Relay];
}

