Falconcodes/Old-main-Kurskaya/FreeRTOS/Projects/TeslaMainBoard/drivers-board/stm32f0_tesla_board.c
/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures EXTI Line.
  * @param  Input: Specifies the Input to be configured.
  *   This parameter can be:
  *     @arg INPUT_RUBILNIK: Big switcher on the wall
  *     @arg INPUT_TUMBLERY: Box (like old refregerator) witch rotary switchers
  *     @arg INPUT_RADIOLA: Device like old radio with 3 "voltmeters"
  * @param  Input_Pull: Specifies Input pull mode.
  *   This parameter can be one of following parameters:
  *     @arg INPUT_PULL_NONE
  *     @arg INPUT_PULL_UP
  * @param  Trigger: Specifies active edge.
  *   This parameter can be one of following parameters:
  *     @arg EXTI_Trigger_Rising
  *     @arg EXTI_Trigger_Falling
  *     @arg EXTI_Trigger_Rising_Falling
  * @retval None
  */
void STM_TESLA_EXTIInit(Input_TypeDef Input, GPIOPuPd_TypeDef Input_Pull, EXTITrigger_TypeDef Trigger)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /* Enable the BUTTON Clock */
  RCC_AHBPeriphClockCmd(INPUT_GPIO_CLK[Input], ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure Button pin as input */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = Input_Pull;
  GPIO_InitStructure.GPIO_Pin = INPUT_PIN[Input];
  GPIO_Init(INPUT_GPIO_PORT[Input], &GPIO_InitStructure);

  /* Connect Button EXTI Line to Button GPIO Pin */
  SYSCFG_EXTILineConfig(INPUT_EXTI_PORT_SOURCE[Input], INPUT_EXTI_PIN_SOURCE[Input]);

  /* Configure Button EXTI line */
  EXTI_InitStructure.EXTI_Line = INPUT_EXTI_LINE[Input];
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = Trigger;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Enable and set Button EXTI Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = INPUT_EXTI_IRQn[Input];
  NVIC_InitStructure.NVIC_IRQChannelPriority = 0x03;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Get EXTI Line by Input number.
  * @param  Input: Specifies the Input to be configured.
  *   This parameter can be:
  *     @arg INPUT_RUBILNIK: Big switcher on the wall
  *     @arg INPUT_TUMBLERY: Box (like old refregerator) witch rotary switchers
  *     @arg INPUT_RADIOLA: Device like old radio with 3 "voltmeters"
  * @retval EXTI Line number
  */
uint32_t STM_TESLA_EXTILine(Input_TypeDef Input)
{
  return INPUT_EXTI_LINE[Input];
}

/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures Input GPIO.
  * @param  Input: Specifies the Input to be configured.
  *   This parameter can be:
  *     @arg INPUT_RUBILNIK: Big switcher on the wall
  *     @arg INPUT_TUMBLERY: Box (like old refregerator) witch rotary switchers
  *     @arg INPUT_RADIOLA: Device like old radio with 3 "voltmeters"
  * @param  Input_Pull: Specifies Input pull mode.
  *   This parameter can be one of following parameters:
  *     @arg INPUT_PULL_NONE
  *     @arg INPUT_PULL_UP
  * @retval None
  */
void STM_TESLA_INPUTInit(Input_TypeDef Input, GPIOPuPd_TypeDef Input_Pull)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable the INPUT Clock */
  RCC_AHBPeriphClockCmd(INPUT_GPIO_CLK[Input], ENABLE);

  /* Configure Button pin as input */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = Input_Pull;
  GPIO_InitStructure.GPIO_Pin = INPUT_PIN[Input];
  GPIO_Init(INPUT_GPIO_PORT[Input], &GPIO_InitStructure);
}

/**
  * @brief  Returns the selected Input state.
  * @param  Input: Specifies the Input to be checked.
  *   This parameter can be one of following parameters:
  *     @arg INPUT_RUBILNIK: Big switcher on the wall
  *     @arg INPUT_TUMBLERY: Box (like old refregerator) witch rotary switchers
  *     @arg INPUT_RADIOLA: Device like old radio with 3 "voltmeters"
  * @retval The Input GPIO pin value.
  */
uint32_t STM_TESLA_INPUTGetState(Input_TypeDef Input)
{
  /* There is no Wakeup button on STM32f0-Discovery Kit */
  return GPIO_ReadInputDataBit(INPUT_GPIO_PORT[Input], INPUT_PIN[Input]);
}

/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures BUZZER GPIO.
  * @retval None
  */
void STM_TESLA_BUZZERInit()
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the BUZZER_GPIO Clock */
  RCC_AHBPeriphClockCmd(BUZZERx_GPIO_CLK, ENABLE);

  /* Configure the RELAY_GPIO pin */
  GPIO_InitStructure.GPIO_Pin = BUZZERx_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(BUZZERx_GPIO_PORT, &GPIO_InitStructure);
}

/**
  * @brief  Turns Buzzer On.
  * @retval None
  */
void STM_TESLA_BUZZEROn()
{
  BUZZERx_GPIO_PORT->BSRR = BUZZERx_PIN;
}

/**
  * @brief  Turns Buzzer Off.
  * @retval None
  */
void STM_TESLA_BUZZEROff()
{
  BUZZERx_GPIO_PORT->BRR = BUZZERx_PIN;
}

/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures LED GPIO.
  * @param  LED: Specifies the LED to be configured.
  *   This parameter can be one of following parameters:
  *     @arg LED_RED
  *     @arg LED_GREEN
  *     @arg LED_BLUE
  * @retval None
  */
void STM_TESLA_LEDInit(LED_TypeDef LED)
{
  GPIO_InitTypeDef  GPIO_InitStructure;

  /* Enable the RELAY_GPIO Clock */
  RCC_AHBPeriphClockCmd(LED_GPIO_CLK[LED], ENABLE);

  /* Configure the RELAY_GPIO pin */
  GPIO_InitStructure.GPIO_Pin = LED_PIN[LED];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(LED_GPIO_PORT[LED], &GPIO_InitStructure);
}

/**
  * @brief  Turns selected LED On.
  * @param  LED: Specifies the LED to be set on.
  *   This parameter can be one of following parameters:
  *     @arg LED_RED
  *     @arg LED_GREEN
  *     @arg LED_BLUE
  * @retval None
  */
void STM_TESLA_LEDOn(LED_TypeDef LED)
{
  LED_GPIO_PORT[LED]->BSRR = LED_PIN[LED];
}

/**
  * @brief  Turns selected LED Off.
  * @param  LED: Specifies the LED to be set off.
  *   This parameter can be one of following parameters:
  *     @arg LED_RED
  *     @arg LED_GREEN
  *     @arg LED_BLUE
  * @retval None
  */
void STM_TESLA_LEDOff(LED_TypeDef LED)
{
  LED_GPIO_PORT[LED]->BRR = LED_PIN[LED];
}

