Falconcodes/Old-main-Kurskaya/FreeRTOS/Projects/TeslaMainBoard/drivers-board/stm32f0_tesla_board.c
/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures Analog Input.
  * @param  None
  * @retval None
  */
void STM_TESLA_ANALOGInit( void )
{
  GPIO_InitTypeDef    GPIO_InitStructure;
  DMA_InitTypeDef     DMA_InitStructure;
  ADC_InitTypeDef     ADC_InitStructure;

  /* GPIO Init */
  for (int ADC_Pin_Number = 0; ADC_Pin_Number < ANALOG_INn; ++ADC_Pin_Number) {
    /* GPIO Periph clock enable */
    RCC_AHBPeriphClockCmd(ANALOG_IN_GPIO_CLK[ADC_Pin_Number], ENABLE);

    /* Configure ADC Channels as analog input */
    GPIO_InitStructure.GPIO_Pin = ANALOG_IN_PIN[ADC_Pin_Number] ;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
    GPIO_Init(ANALOG_IN_GPIO_PORT[ADC_Pin_Number], &GPIO_InitStructure);
  }

  /* ADC DeInit */
  ADC_DeInit(ANALOG_IN_ADC);

  /* ADC Periph clock enable */
  RCC_APB2PeriphClockCmd(ANALOG_IN_ADC_CLK, ENABLE);

  /* DMA clock enable */
  RCC_AHBPeriphClockCmd(ANALOG_IN_DMA_CLK , ENABLE);

  /* DMA Channel Config */
  DMA_DeInit(ANALOG_IN_DMA_CHANNEL);
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)ANALOG_IN_ADC_DR_Address;
  DMA_InitStructure.DMA_MemoryBaseAddr     = (uint32_t)ANALOG_IN_BUFFER;
  DMA_InitStructure.DMA_DIR                = DMA_DIR_PeripheralSRC;
  DMA_InitStructure.DMA_BufferSize         = ANALOG_INn;
  DMA_InitStructure.DMA_PeripheralInc      = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc          = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
  DMA_InitStructure.DMA_MemoryDataSize     = DMA_MemoryDataSize_HalfWord;
  DMA_InitStructure.DMA_Mode               = DMA_Mode_Circular;
  DMA_InitStructure.DMA_Priority           = DMA_Priority_High;
  DMA_InitStructure.DMA_M2M                = DMA_M2M_Disable;
  DMA_Init(ANALOG_IN_DMA_CHANNEL, &DMA_InitStructure);

  /* DMA Channel enable */
  DMA_Cmd(ANALOG_IN_DMA_CHANNEL, ENABLE);

  /* ADC DMA request in circular mode */
  ADC_DMARequestModeConfig(ANALOG_IN_ADC, ADC_DMAMode_Circular);

  /* Enable ADC_DMA */
  ADC_DMACmd(ANALOG_IN_ADC, ENABLE);

  /* Initialize ADC structure */
  ADC_StructInit(&ADC_InitStructure);

  /* Configure the ADC1 in continous mode withe a resolutuion equal to 12 bits  */
  ADC_InitStructure.ADC_Resolution           = ADC_Resolution_12b;
  ADC_InitStructure.ADC_ContinuousConvMode   = ENABLE;
  ADC_InitStructure.ADC_ExternalTrigConvEdge = ADC_ExternalTrigConvEdge_None;
  ADC_InitStructure.ADC_DataAlign            = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_ScanDirection        = ADC_ScanDirection_Backward; // 0-7-6-5-4-3-2-1
  ADC_Init(ANALOG_IN_ADC, &ADC_InitStructure);

  /* Convert the ADC Channels */
  for (int ADC_Pin_Number = 0; ADC_Pin_Number < ANALOG_INn; ++ADC_Pin_Number) {
    ADC_ChannelConfig(ANALOG_IN_ADC,
                      ANALOG_IN_ADC_CHANNEL[ADC_Pin_Number],
                      ANALOG_IN_ADC_ADC_SAMPLE_TIME);
  }

  /* ADC Calibration */
  ADC_GetCalibrationFactor(ANALOG_IN_ADC);

  /* Enable ADC1 */
  ADC_Cmd(ANALOG_IN_ADC, ENABLE);

  /* Wait the ADCEN falg */
  while(!ADC_GetFlagStatus(ANALOG_IN_ADC, ADC_FLAG_ADEN));

  /* ADC1 regular Software Start Conv */
  ADC_StartOfConversion(ANALOG_IN_ADC);
}

/**
  * @brief  Returns the selected Analog Input value.
  * @param  AnalogIn: Specifies the Analog Input to be readed (from buffer)
  *   This parameter can be one of following parameters:
  *     @arg ANALOG_IN1: One of phototransistors on the head
  *     @arg ANALOG_IN2: One of phototransistors on the head
  *     @arg ANALOG_IN3: One of phototransistors on the head
  *     @arg ANALOG_IN4: One of phototransistors on the head
  * @retval The Analog Input value (from last ADC -> DMA -> Memory transaction).
  */
uint16_t STM_TESLA_ANALOGGetValue( AnalogIn_TypeDef AnalogIn )
{
  return ANALOG_IN_BUFFER[AnalogIn];
}

/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures PWM Output.
  * @param  PWMOut: Specifies the PWM Output to be configured.
  *   This parameter can be:
  *     @arg PWM_OUT_TO_GENERATOR: Show value on "Ampermeter" inside generator
  * @retval None
  */
void STM_TESLA_PWMInit( PWM_Out_TypeDef PWMOut )
{
  GPIO_InitTypeDef         GPIO_InitStructure;
  TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

  /* GPIO Clocks enable */
  RCC_AHBPeriphClockCmd( PWM_OUT_GPIO_CLK[PWMOut], ENABLE);

  /* GPIO Configuration: Channel X as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin   = PWM_OUT_PIN[PWMOut];
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP ;
  GPIO_Init(PWM_OUT_GPIO_PORT[PWMOut], &GPIO_InitStructure);

  GPIO_PinAFConfig(PWM_OUT_GPIO_PORT[PWMOut],
                   PWM_OUT_SOURCE[PWMOut],
                   PWM_OUT_AF[PWMOut]);

  /* TIM1 Configuration */

  /* Compute the value to be set in ARR regiter
     to generate signal frequency at 10 kHz */
  PWMTimerPeriod[PWMOut] = (SystemCoreClock / 10000 ) - 1;
  /* Compute CCR1 value to generate a duty cycle at 0% (OFF) for channel 1 */
  PWMPulse[PWMOut] = (uint16_t) (((uint32_t) 0 *
                                  (PWMTimerPeriod[PWMOut] - 1)) / 100);

  /* TIM clock enable */
  RCC_APB2PeriphClockCmd(PWM_OUT_TIM_CLK[PWMOut] , ENABLE);

  /* Time Base configuration */
  TIM_TimeBaseStructure.TIM_Prescaler         = 0;
  TIM_TimeBaseStructure.TIM_CounterMode       = TIM_CounterMode_Up;
  TIM_TimeBaseStructure.TIM_Period            = PWMTimerPeriod[PWMOut];
  TIM_TimeBaseStructure.TIM_ClockDivision     = 0;
  TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;

  TIM_TimeBaseInit(PWM_OUT_TIM[PWMOut], &TIM_TimeBaseStructure);

  /* Channel Configuration in PWM mode */
  PWM_OCInitStructure[PWMOut].TIM_OCMode       = TIM_OCMode_PWM2;
  PWM_OCInitStructure[PWMOut].TIM_OutputState  = TIM_OutputState_Enable;
  PWM_OCInitStructure[PWMOut].TIM_OutputNState = TIM_OutputNState_Disable;
  PWM_OCInitStructure[PWMOut].TIM_OCPolarity   = TIM_OCPolarity_Low;
  PWM_OCInitStructure[PWMOut].TIM_OCNPolarity  = TIM_OCNPolarity_High;
  PWM_OCInitStructure[PWMOut].TIM_OCIdleState  = TIM_OCIdleState_Set;
  PWM_OCInitStructure[PWMOut].TIM_OCNIdleState = TIM_OCIdleState_Reset;

