Falconcodes/Old-main-Kurskaya/FreeRTOS/Projects/TeslaMainBoard/drivers-board/stm32f0_tesla_board.c
  PWM_OCInitStructure[PWMOut].TIM_Pulse = PWMPulse[PWMOut];
  TIM_OC1Init(PWM_OUT_TIM[PWMOut], &PWM_OCInitStructure[PWMOut]);

  /* TIM1 counter enable */
  TIM_Cmd(PWM_OUT_TIM[PWMOut], ENABLE);

  /* TIM1 Main Output Enable */
  TIM_CtrlPWMOutputs(PWM_OUT_TIM[PWMOut], ENABLE);
}

/**
  * @brief  Sets the selected PWM Output duty cycle.
  * @param  PWMOut: Specifies the PWM Output to be updated
  *   This parameter can be one of following parameters:
  *     @arg PWM_OUT_TO_GENERATOR: Show value on "Ampermeter" inside generator
  * @param  DutyCycle: Specifies PWM Duty Cycle.
  *   This parameter can be 0..100 (in percents), so 0=OFF; 100=MAX_VOLTAGE.
  * @retval None
  */
void STM_TESLA_PWMSetDutyCycle( PWM_Out_TypeDef PWMOut, uint16_t DutyCycle )
{
  PWMPulse[PWMOut] = (uint16_t) (((uint32_t) DutyCycle *
                                  (PWMTimerPeriod[PWMOut] - 1)) / 100);

  PWM_OCInitStructure[PWMOut].TIM_Pulse = PWMPulse[PWMOut];
  TIM_OC1Init(PWM_OUT_TIM[PWMOut], &PWM_OCInitStructure[PWMOut]);
}

/* -------------------------------------------------------------------------- */

/**
  * @brief  Configures Encoder Input.
  * @param  Encoder: Specifies the Encoder to be configured.
  *   This parameter can be:
  *     @arg ENCODER_FROM_GENERATOR: Detect handle rotation on the generator
  * @retval None
  */
void STM_TESLA_ENCODERInit( Encoder_TypeDef Encoder )
{
  GPIO_InitTypeDef         GPIO_InitStructure;

  /* TIM clock enable */
  ClockFuncType TIM_StartClock = ENCODER_TIM_CLOCK_CMD[Encoder];
  TIM_StartClock(ENCODER_TIM_CLK[Encoder], ENABLE);

  /* GPIO clock enable */
  RCC_AHBPeriphClockCmd(ENCODER_CH1_GPIO_CLK[Encoder], ENABLE);
  RCC_AHBPeriphClockCmd(ENCODER_CH2_GPIO_CLK[Encoder], ENABLE);

  /* TIM channels configuration */
  GPIO_InitStructure.GPIO_Pin   = ENCODER_CH1_PIN[Encoder];
  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP ;
  GPIO_Init(ENCODER_CH1_GPIO_PORT[Encoder], &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin   = ENCODER_CH2_PIN[Encoder];
  GPIO_Init(ENCODER_CH2_GPIO_PORT[Encoder], &GPIO_InitStructure);

  /* Connect TIM pin to AF */
  GPIO_PinAFConfig(ENCODER_CH1_GPIO_PORT[Encoder],
                   ENCODER_CH1_SOURCE[Encoder],
                   ENCODER_CH1_AF[Encoder]);
  GPIO_PinAFConfig(ENCODER_CH2_GPIO_PORT[Encoder],
                   ENCODER_CH2_SOURCE[Encoder],
                   ENCODER_CH2_AF[Encoder]);

  /* Configure encoder */
  TIM_EncoderInterfaceConfig(ENCODER_TIM[Encoder],
                             TIM_EncoderMode_TI12,
                             TIM_ICPolarity_Rising,
                             TIM_ICPolarity_Rising);
  TIM_SetAutoreload(ENCODER_TIM[Encoder], 0xffff);

  /* Turn on */
  TIM_Cmd(ENCODER_TIM[Encoder], ENABLE);

  /* Reset */
  TIM_SetCounter(ENCODER_TIM[Encoder], 0x00);
}

/**
  * @brief  Returns the selected Encoder Input value.
  * @param  Encoder: Specifies the Encoder to be readed
  *   This parameter can be one of following parameters:
  *     @arg ENCODER_FROM_GENERATOR: Detect handle rotation on the generator
  * @retval The Encoder current value.
  */
int16_t STM_TESLA_ENCODERGetValue( Encoder_TypeDef Encoder )
{
  uint32_t value = TIM_GetCounter(ENCODER_TIM[Encoder]);
  return (int16_t)(value & 0xFFFF);
}

/* -------------------------------------------------------------------------- */

/**
  * @brief  Initializes all board hardware.
  * @param  None
  * @retval None
  */
void vBoardHardwareInitialize( void )
{
  /* Ininialize USART interface */
  vSerialPortInit(serCOM1, USARTx_BAUD, USARTx_BUFFER_LEN);
  vSerialPortInit(serCOM2, USARTy_BAUD, USARTy_BUFFER_LEN);

  /* Initialize I2C interface */
  vI2CPortInitMinimal();

  /* Initialize all relays */
  STM_TESLA_RELAYInit((Relay_TypeDef)0);
  STM_TESLA_RELAYInit((Relay_TypeDef)1);
  STM_TESLA_RELAYInit((Relay_TypeDef)2);
  STM_TESLA_RELAYInit((Relay_TypeDef)3);
  STM_TESLA_RELAYInit((Relay_TypeDef)4);
  STM_TESLA_RELAYInit((Relay_TypeDef)5);
  STM_TESLA_RELAYInit((Relay_TypeDef)6);
  STM_TESLA_RELAYInit((Relay_TypeDef)7);

  STM_TESLA_RELAYInit((Relay_TypeDef)8);
  STM_TESLA_RELAYInit((Relay_TypeDef)9);
  STM_TESLA_RELAYInit((Relay_TypeDef)10);
  STM_TESLA_RELAYInit((Relay_TypeDef)11);
  STM_TESLA_RELAYInit((Relay_TypeDef)12);
  STM_TESLA_RELAYInit((Relay_TypeDef)13);
  STM_TESLA_RELAYInit((Relay_TypeDef)14);
  STM_TESLA_RELAYInit((Relay_TypeDef)15);

  STM_TESLA_RELAYInit((Relay_TypeDef)16);

  /* Initialize digital inputs */
  STM_TESLA_INPUTInit(INPUT_RUBILNIK, GPIO_PuPd_UP);
  STM_TESLA_INPUTInit(INPUT_TUMBLERY, GPIO_PuPd_UP);
  STM_TESLA_INPUTInit(INPUT_RADIOLA,  GPIO_PuPd_NOPULL);
  STM_TESLA_INPUTInit(INPUT_KEYHOLE,  GPIO_PuPd_UP);
  STM_TESLA_INPUTInit(INPUT_GRAPHITE, GPIO_PuPd_UP);
  STM_TESLA_INPUTInit(INPUT_5, GPIO_PuPd_UP);
#ifdef ENABLE_ELECTROMECH
  STM_TESLA_EXTIInit (INPUT_7X7KNOPKI,  GPIO_PuPd_DOWN, EXTI_Trigger_Rising);
  STM_TESLA_EXTIInit (INPUT_BELL,       GPIO_PuPd_UP,   EXTI_Trigger_Falling);
  STM_TESLA_EXTIInit (INPUT_220V_SENSE, GPIO_PuPd_UP,   EXTI_Trigger_Rising);
#endif


  /* Initialize buzzer */
  STM_TESLA_BUZZERInit();

  /* Initialize LEDs */
  STM_TESLA_LEDInit(LED_RED);
  STM_TESLA_LEDInit(LED_GREEN);
  STM_TESLA_LEDInit(LED_BLUE);

  /* Initialize analog inputs */
  STM_TESLA_ANALOGInit();

  /* Initialize PWM outputs */
  STM_TESLA_PWMInit(PWM_OUT_TO_GENERATOR);

  /* Initialize encoders */
  STM_TESLA_ENCODERInit(ENCODER_FROM_GENERATOR);
  STM_TESLA_ENCODERInit(ENCODER_FROM_PROJECTOR);
}